data_generation/simulation_results/openfoam/case_45/constant/simParams
nIter 2000;
hComponent0 912.6203432251307;
hComponent1 1239.6602503885474;
hComponent2 666.9329984716913;
hComponent3 693.6416876975965;
hComponent4 1282.6126715768942;kComponent0 59.158665033783016;
kComponent1 12.476428981134767;
kComponent2 86.25078419724349;
kComponent3 19.49488929688343;
kComponent4 18.65134710974837;
tAmbient 300;
Ux 0.579188308029926;
kPCB 0.3831807459640828;